app/Controllers/Frontend/HomeController.php

    public function index($trial_name = null)
    {
        // client
        $client_model = new ClientModel();
        $client = $client_model->where("domain_live_url", base_url())->where('status', 1)->get()->getFirstRow();
        // define trial or prod
        if ($client->is_production == 1) {
            $is_production = 1;
            $client_id = $client->id;
        } else {
            $is_production = 0;
            if ($trial_name != null) {
                $trial_access_name = $trial_name;
            } else {
                $trial_access_name = null;
            }
            $client = $client_model->where("domain_live_url", base_url())->where('trial_access_name', $trial_access_name)->where('status', 1)->get()->getFirstRow();
            if ($client) {
                $client_id = $client->id;
            } else {
                return redirect()->to(base_url('/'));
            }
        }
        $data['trial_name'] = $trial_name;
        $data['is_production'] = $is_production;
        // config
        $config = new ConfigModel();
        $data['config'] = $config->where('client_id', $client_id)->where('status', 1)->get()->getFirstRow();
        // config menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->where('client_id', $client_id)->where('status', 1)->get()->getFirstRow();
        // slider event
        $slider_event = new SliderEvent();
        $data['slider_events'] = $slider_event->where('client_id', $client_id)->where('status', 1)->get()->getResult();
        // slider text
        $slider_text = new SliderText();
        $data['slider_texts'] = $slider_text->where('client_id', $client_id)->where('status', 1)->get()->getResult();
---
SELECT *
FROM `clinic002_config_menu`
WHERE `client_id` = 'c149900f-c62f-11ed-bdc7-b0227a7395f6'
AND `status` = 1
SELECT *
FROM `clinic002_slider_event`
WHERE `client_id` = 'c149900f-c62f-11ed-bdc7-b0227a7395f6'
AND `status` = 1
SELECT *
FROM `clinic002_slider_text`
WHERE `client_id` = 'c149900f-c62f-11ed-bdc7-b0227a7395f6'
AND `status` = 1